Autodesk.Revit.DB.BuiltInFailures.SweepFailures.SweepFailedError
Proper sweep geometry creation failed.

Autodesk.Revit.DB.BuiltInFailures.SweepFailures.SweepFailed
Proper sweep geometry creation failed.

Autodesk.Revit.DB.BuiltInFailures.SweepFailures.ProfileLoopEmpty
Profile sketch is empty!

Autodesk.Revit.DB.BuiltInFailures.SweepFailures.ComplexPathWithComplexProfile
Sweep cannot have a path with ellipse or spline segments and a profile with non-straight lines.

Autodesk.Revit.DB.BuiltInFailures.SweepFailures.CannotDrawSweep
Can't create sweep.

Autodesk.Revit.DB.BuiltInFailures.SweepFailures
Failures about Sweep.